Vamos aprender a seleionar valores em um DataFrame mas primeiro vamos criar um dicíonario com pandas para amazenar as notas dos alunos 'Maria','Jose', 'Witoria', depois armazena-lo em um DataFrame e por fim selecionar um valor no nossa DataFrame. Primeiro temos que importar a biblioteca pandas para criar o nosso dataframe. Lembrando que cada chave será uma coluna do DataFrame.

# **Importando a biblioteca Pandas**

In [ ]:
import pandas as pd

# **Criando um dicionário onde cada chave será uma coluna do DataFrame**

In [ ]:
# Criando um dicionário onde cada chave será uma coluna do DataFrame
dicionario = {
'Alunos':    ['Maria', 'Jose', 'Witoria'],
'Historia':  [8, 9 ,10],
'Geografia': [10, 9, 7]
}

In [ ]:
#Criando o DataFrame
df = pd.DataFrame(dicionario, columns=['Alunos','Historia','Geografia'])

# **visualizando o DataFrame**

In [ ]:
# visualizando o DataFrame
df

    Alunos  Historia  Geografia
0    Maria         8         10
1     Jose         9          9
2  Witoria        10          7

# **Selecionando os dados da aluna Maria**

In [ ]:
#Selecionando os dados da aluna Maria 
df.loc[0]

Alunos       Maria
Historia         8
Geografia       10
Name: 0, dtype: object

# **Selecionando os dados do aluno jose**

In [ ]:
#Selecionando os dados d0 aluno jose 
df.loc[1]

Alunos       Jose
Historia        9
Geografia       9
Name: 1, dtype: object

# **Selecionando os dados da aluna witoria**

In [ ]:
#Selecionando os dados da aluna witoria 
df.loc[2]

Alunos       Witoria
Historia          10
Geografia          7
Name: 2, dtype: object

# **Selecionando a primeira linha da coluna 'Alunos'**

In [ ]:
#Selecionando a primeira linha da coluna 'Alunos'
df.loc[0, 'Alunos']

'Maria'

# **Selecionando a segunda linha da coluna 'Geografia'**

In [ ]:
#Selecionando a segunda linha da coluna 'Geografia'
df.loc[1, 'Geografia']

9

# **Passando as notas da coluna Historia Para coluna Geografia e as notas da coluna Geografia para coluna historia**

In [ ]:
df[['Historia', 'Geografia']] = df[['Geografia', 'Historia']]

In [ ]:
# visualizando
df

    Alunos  Historia  Geografia
0    Maria        10          8
1     Jose         9          9
2  Witoria         7         10

**Obs** isso nao é a maneira correta de passar os valores para outra coluna.

# **Passando as notas da coluna Geografia Para coluna Historia e as notas da coluna Historia para coluna Geografia (maneira correta)**

In [ ]:
# importando a biblioteca numpy
import numpy as np

In [ ]:
df.loc[:, ['Geografia', 'Historia']] = df[['Historia', 'Geografia']].to_numpy()

In [ ]:
#visualizando
df

    Alunos  Historia  Geografia
0    Maria         8         10
1     Jose         9          9
2  Witoria        10          7

# **Imprimindo as duas primeiras linhas do DataFrame (basta voce passar o numero de linha que voce quer visualizar**

In [ ]:
df[:2]

  Alunos  Historia  Geografia
0  Maria         8         10
1   Jose         9          9

# **Verificar se há notas inferiores a (O) na 'Geografia'** Ele retorna True caso existem e Falso caso nao existem.

In [ ]:
df['Geografia'] < 0

0    False
1    False
2    False
Name: Geografia, dtype: bool

In [ ]:
# visualizando os valores da coluna Geografia que sao inferiores a 0
df.loc[df['Geografia'] <0]

Empty DataFrame
Columns: [Alunos, Historia, Geografia]
Index: []

# **Verificar se há notas superiores a (5) na 'Geografia'** Ele retorna True caso existem e Falso caso nao existem.

In [ ]:
df['Geografia'] > 5

0    True
1    True
2    True
Name: Geografia, dtype: bool

In [ ]:
# visualizando os valores da coluna Geografia que sao superiores a 5
df.loc[df['Geografia'] > 5]

    Alunos  Historia  Geografia
0    Maria         8         10
1     Jose         9          9
2  Witoria        10          7

# **Verificar se há notas igual a (9) na 'Geografia'** Ele retorna True caso existem e Falso caso nao existem.

In [ ]:
df['Geografia'] == 9

0    False
1     True
2    False
Name: Geografia, dtype: bool

In [ ]:
# visualizando os valores da coluna Geografia que sao iguais as 9
df.loc[df['Geografia'] == 9]

  Alunos  Historia  Geografia
1   Jose         9          9

# **Visualizando apenas as notas dos alunos Maria e witoria.**

In [ ]:
df.loc[df.index[[0, 2]]]

    Alunos  Historia  Geografia
0    Maria         8         10
2  Witoria        10          7

# **Visualizando apenas as notas de Geografia dos alunos Maria e witoria.**

In [ ]:
df.loc[df.index[[0, 2]], 'Geografia']

0    10
2     7
Name: Geografia, dtype: int64

# **Selecionando a nota maxima na coluna Geografia**

In [ ]:
df['Geografia'].max()

10

# **Selecionando a nota minima na coluna Geografia**

In [ ]:
df['Geografia'].min()

7